# RiseDividedBy12Inches Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..RiseDividedBy12Inches Property
UnitTypeId Class See Also
---
Rise / 12 inches.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId RiseDividedBy12Inches { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RiseDividedBy12Inches As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RiseDividedBy12Inches {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace